Podkova/src/Catalogs/УсловияПредоставленияСкидокНаценок/УсловияПредоставленияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УсловияПредоставленияСкидокНаценок</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УсловиеПредоставления</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      <types>EnumRef.УсловияПредоставленияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОпределенияПериодаНакопительнойСкидки</name>
    <type>
      <types>EnumRef.ВариантыОпределенияПериодаНакопительнойСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНакопления</name>
    <type>
      <types>EnumRef.ВариантыНакопленияКумулятивнойСкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>КритерийОграниченияПримененияЗаОбъемПродаж</name>
    <type>
      <types>EnumRef.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОграничения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикОплаты</name>
    <type>
      <types>CatalogRef.ГрафикиОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеУсловияОграничения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СегментНоменклатурыОграничения</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНакопления</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСравнения</name>
    <type>
      <types>EnumRef.ТипыСравненияЗначенийСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКартыЛояльности</name>
    <type>
      <types>CatalogRef.ВидыКартЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментПартнеров</name>
    <type>
      <types>CatalogRef.СегментыПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовНакопления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтбораНоменклатуры</name>
    <type>
      <types>EnumRef.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДоДняРождения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейПослеДняРождения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьТекущуюПродажуВНакопленныйОбъемПродаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыВнешнейОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВремяДействия</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Podkova/src/Catalogs/УсловияПредоставленияСкидокНаценок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Получает реквизиты объекта, которые необходимо блокировать от изменения
//
// Возвращаемое значение:
//  Массив - блокируемые реквизиты объекта.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("УсловиеПредоставления");
	Результат.Добавить("ВариантОпределенияПериодаНакопительнойСкидки");
	
	Результат.Добавить("ВариантНакопления");
	Результат.Добавить("КритерийОграниченияПримененияЗаОбъемПродаж");
	Результат.Добавить("ВалютаОграничения");
	Результат.Добавить("ГрафикОплаты");
	Результат.Добавить("ФормаОплаты");
	Результат.Добавить("ЗначениеУсловияОграничения");
	Результат.Добавить("СегментНоменклатурыОграничения");
	Результат.Добавить("ПериодНакопления");
	Результат.Добавить("ТипСравнения");
	Результат.Добавить("ГруппаПользователей");
	Результат.Добавить("ВремяДействия");
	Результат.Добавить("ВидКартыЛояльности");
	Результат.Добавить("КоличествоПериодовНакопления");
	Результат.Добавить("СегментПартнеров");
	Результат.Добавить("ВариантОтбораНоменклатуры");
	Результат.Добавить("ВключатьТекущуюПродажуВНакопленныйОбъемПродаж");
	Результат.Добавить("КоличествоДнейПослеДняРождения");
	Результат.Добавить("КоличествоДнейДоДняРождения");

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
